app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT * FROM "movies"

  def create
    @movie = Movie.new(params[:movie])

    if @movie.save
---
INSERT INTO "movies" ("created_at", "title", "plot", "updated_at") VALUES('2010-08-03 13:37:37', 'Test', 'Test', '2010-08-03 13:37:37')

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(params[:movie])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)
UPDATE "movies" SET "updated_at" = '2010-08-03 13:50:33', "title" = 'Test update', "plot" = 'Testupdate' WHERE "id" = 1